{
    "latestVersion": "2.0.5",
    "critical": false,
    "notes": "## 🔧 v2.0.5 — Overlay/Tint Rework + PF2e Fixes\n\n### Improvements\n* **Overlay/Tint Follow Portrait Transform**: Overlay and tint now track portrait position, scale, and offset via CSS custom properties.\n* **Tint Matches Portrait Silhouette**: Tint color masked to portrait shape using CSS `mask-image`.\n* **V13 ActiveEffect Compatibility**: Condition icons now read `ActiveEffect#img` instead of deprecated `#icon`.\n\n### Bug Fixes\n* **PF2e Perception Shows 0**: Fixed Perception displaying as 0 on HUD cards — PF2e models it as a Statistic object, not a simple value path.\n* **Status Effects Overlay/Tint Now Visible**: Fixed z-index so overlay/tint render above the portrait.\n* **Per-Actor Format \"Auto\" Display Fix**: Config UI now correctly shows \"Auto\" when set.\n* **Theme Default Format Fallback**: Iron/Glass/Cyberpunk now correctly default to Box format.\n* **PF2e/DnD5e Quick Slot Favorites**: Non-item favorites now visible in quick access slots.\n* **Favorites Migration Cleanup**: Fixed valid compound favorites being silently removed.\n* **Portrait Variant Picker Position**: Picker now anchors to the actual portrait image.\n* **D&D5e Activity Spells in MAGIC Tab**: Spells added as Cast Activities now appear in a dedicated \"Item Spells\" sidebar tab.\n\n---\n\n## 🐛 v2.0.4 — Config Preview Fixes\n* **Per-Actor Preview Inherits Global Defaults**: Fixed preview losing global card size/format when any per-actor setting is changed.\n* **Global Config Position Jump**: Fixed card positions jumping when changing global settings.\n* **Tracked Attribute Font Color Live Update**: Fixed label/value font colors not applying during live preview.\n* **Global Preview Overwrites Per-Actor Settings**: Fixed global setting changes resetting per-actor overrides.\n* **PF2e Missing Attribute Visual Properties**: Fixed PF2e tracked attributes missing font colors, badge conditions, position offsets.\n* **Status X/Y Not Loading on Config Open**: Fixed conditionsX/conditionsY always showing 0 and resetting on save.\n\n---\n\n## ✨ v2.0.3\n* **Disable Update Notifications**: You can now turn off update notification popups. Toggle in module settings or click \"Don't show again.\"\n* **Duplicate Update Dialog Fix**: Fixed update notification appearing twice on startup.\n* **Per-Actor Card Scale Reset**: Fixed card scale reset not reverting to global default — was staying at 1.0 instead.\n* **Card Scale Config UI**: Scale field now shows blank with \"AUTO\" placeholder when unset, consistent with other per-actor fields.\n\n---\n\n## ✨ v2.0.2\n* **Global Macro Flavor Text**: GMs can right-click any global macro in the action menu to set custom flavor text. The text appears as a tooltip for all players.\n* **Personal Macro Deletion Fix**: Fixed a bug where deleting a personal macro from a category would revert after page refresh.\n* ⚠️ If a player has already set personal flavor text on a macro, it takes priority over the GM's global flavor. Clear the personal override to see the global text.\n\n---\n\n## 🐛 Hotfix v2.0.1\n* **OBS Overlay URL Fix**: Restored missing overlay.html bridge page — fixes \"Cannot GET\" errors when using overlay URLs.\n* **V12 Compatibility — Shift Key Detection**: Fixed isModifierActive crash on V12.\n* **V12 Compatibility — DialogV2 Callbacks**: Fixed dialog.element.querySelector crash in V12 for editResource, editSpellSlots, editMacro, and UpdateNotifier dialogs.\n* **Update Notification Scroll**: Long patch notes no longer overflow the dialog window.\n\n---\n\n## ⚠️ World Backup Recommended\nThis is a major update. Please **back up your world** before updating.\n\n---\n\n## ✨ Major Update v2.0.0\n### 🎨 Custom Theme Engine\n* **Full Custom Theme**: Stack multiple image layers on portraits and card backgrounds with per-layer Z-Index, position, scale, rotation, opacity, and blend mode controls.\n* **Action Menu Layers & Colors**: Fully customize every Action Menu element — buttons, headers, tabs, sidebars, list items, and more.\n* **Element Image Defaults**: Set custom images for bar frames, fills, backgrounds, dots, and number backgrounds globally.\n* **Per-Attribute Image Overrides**: Override element images per attribute with independent position, scale, and rotation.\n* **Card Size & Scale**: Configure card width/height globally and per-actor. Per-actor scale multiplier for individual sizing.\n* **Theme Export / Import**: Export your entire Custom Theme as a `.zip` (colors, layers, images, conditions, sounds). Import on any world — images are automatically uploaded and paths rewritten.\n\n### 🖥 Compact Mode\n* Cards collapse into themed portrait thumbnails and expand on hover.\n* Each theme (Iron, Glass, Fantasy, Medieval, Cyberpunk, Custom) has a unique compact shape.\n* Toggle via `Shift+C` or config checkbox. Per-actor override: Always Collapsed / Always Expanded / Use Global.\n\n### 🎲 Stat Click-to-Roll\n* Clicking a rollable stat on the HUD triggers the dice roll directly.\n* **PF2e**: Saves, Skills, Perception, Initiative. **DnD5e**: Ability Checks, Saving Throws, Skills, Initiative.\n* Alt+Click opens the value editor on any stat. Rollable stats show a dotted underline on hover.\n\n### 📺 Broadcast Account for OBS\n* Designate a Foundry user as a dedicated broadcast account — overlay mode activates automatically on login.\n* GM can switch the displayed actor live; changes apply to the broadcast client in real-time.\n\n### 🔧 And More\n* Category Visibility Filter (show/hide categories by actor type or identity)\n* Per-Attribute Text Colors, Global Name/Portrait/Card Format controls\n* Portrait Frame Layer, Per-Badge Conditional Images\n* Independent Number/Label Positioning, End Turn Button Position",
    "downloadUrl": "",
    "forceResetId": null,
    "announcement": {
        "show": true,
"id": "v2.0.5-overlay-pf2e",
        "title": "🔧 v2.0.5: Overlay/Tint Rework + PF2e Fixes",
        "content": "Overlay and tint now follow portrait transforms and mask to the portrait silhouette. Fixed PF2e Perception showing 0 on HUD cards, status effect z-index, quick slot favorites, and D&D5e Activity Spells in MAGIC tab."
    }
}