{
    "latestVersion": "1.5.4",
    "critical": false,
    "notes": "📢 Update: Stylish Action HUD v1.5.4\n\n✨ New Features (v1.5.4)\n* **Quick Action Menu Positioning (Long-press Drag)**: You can now reposition the Action Menu without entering Layout Mode. Simply long-press (hold for 0.4s) anywhere on the Action Menu to drag it. Releasing it will automatically save the new position.\n\n🛠 Bug Fixes (v1.5.4)\n* **Status Effect Settings**: Fixed a bug where Animation and Blend Mode dropdowns were empty in the Status Effects configuration tab.\n* **Layout Mode Exit Fix**: Resolved a critical issue where HUD elements remained draggable/unlocked when exiting Layout Mode via the toolbar button.\n* **Toolbar Save Action**: Exiting Layout Mode via the toolbar button now correctly saves changes instead of discarding them.\n\n--- \n\n🎁 Earlier in v1.5.3 & v1.5.2\n* **Restored sidebar settings button**: Restored the missing button to access the configuration from the sidebar menu.\n* **Split configuration permissions**: Separate role thresholds for editing Tracking, Style/Layout, and Menu settings.\n* **Auto-populate & Auto-add PCs**: Automatically manages Party HUD members on new installs or PC creation.\n* **Fixed Layout Drift**: HUD positions now remain consistent across different screen aspect ratios and sizes.\n* **Flicker-Free Turns**: Optimized DOM rendering to eliminate visual flicker during combat turn changes.\n\n--- \n\n🎁 Earlier in v1.5.0\n* **Dynamic Portraits**: Character portraits react to Status Effects (Poisoned, Dead, etc.).\n* **Font Customization**: Customize Header and Body fonts independently.\n* **Macro Description Editing**: Right-click any macro to customize its tooltip flavor text.\n* **Per-Actor Card Scale**: Adjust individual card sizes (e.g., 0.6x for familiars).",
    "downloadUrl": "",
    "forceResetId": null,
    "announcement": {
        "show": true,
        "id": "v1.5.4-update",
        "title": "🚀 v1.5.4: Quick Drag & UI Fixes",
        "content": "New: Long-press to drag the Action Menu! Also fixes Status Effect dropdowns and Layout Mode save issues."
    }
}
