{
    "latestVersion": "1.5.3",
    "critical": false,
    "notes": "📢 Update: Stylish Action HUD v1.5.3\n\n🛠 Bug Fixes (v1.5.3)\n* **Restored sidebar settings button**: Restored the missing button to access the Stylish Action HUD configuration from the sidebar settings menu.\n\n✨ New Features (v1.5.2)\n* **Split configuration permissions**: Added separate role thresholds for editing Tracking, Style/Layout, and Menu settings.\n* **Auto-populate Party HUD**: Automatically selects existing Player Characters for the Party HUD on new installs.\n* **Auto-add new PCs**: New PCs or actors gaining player ownership are now automatically added to the HUD.\n* **Default tracking seeding**: Automatically seeds default tracking attributes (like HP) and status effects suitable for the game system.\n\n🛠 Bug Fixes (v1.5.2)\n* **Fixed Layout Drift**: Resolved issue where HUD positions would drift or jump on screens with different aspect ratios.\n* **Sidebar Collision**: The HUD now respects sidebar boundaries and clamps its position to prevent overlapping.\n* **Screen Size Consistency**: Fixed position shift issues when moving between ultrawide and smaller monitors.\n* **Edit Mode Snapping**: Fixed containers incorrectly snapping to top-left when entering Layout Edit Mode.\n* **Flicker-Free Turns**: Turn changes no longer trigger a full DOM re-render, eliminating visual flicker.\n* **Actor Reset**: The Reset button now properly clears all actor-level flags and overrides.\n\n--- \n\n🎁 Earlier in v1.5.0\n* **Dynamic Portraits**: Character portraits can now react to Status Effects (Poisoned, Prone, Dead, etc.).\n* **Font Customization**: Customize Header and Body fonts independently with live previews.\n* **Macro Description Editing**: Right-click any macro in the Action Menu to customize its tooltip flavor text.\n* **Per-Actor Card Scale**: Adjust individual character card sizes (e.g., 0.6x for familiars).\n* **PF2e Enhancements**: Dynamically tracks all available movement speeds for Pathfinder 2e actors.\n* **Searchable Attributes**: The attribute selection dropdown is now fully searchable and sorted.",
    "downloadUrl": "",
    "forceResetId": null,
    "announcement": {
        "show": true,
        "id": "v1.5.3-update",
        "title": "🚀 v1.5.3: Sidebar Button Fix & Stability",
        "content": "Restored the missing sidebar settings button. Includes v1.5.2 automation and v1.5.0 dynamic portrait features!"
    }
}
