{
    "latestVersion": "2.0.1",
    "critical": true,
    "notes": "## 🐛 Hotfix v2.0.1\n* **OBS Overlay URL Fix**: Restored missing overlay.html bridge page — fixes \\\"Cannot GET\\\" errors when using overlay URLs.\n* **V12 Compatibility — Shift Key Detection**: Fixed isModifierActive crash on V12.\n* **V12 Compatibility — DialogV2 Callbacks**: Fixed dialog.element.querySelector crash in V12 for editResource, editSpellSlots, editMacro, and UpdateNotifier dialogs.\n* **Update Notification Scroll**: Long patch notes no longer overflow the dialog window.\n\n---\n\n## ⚠️ World Backup Recommended\nThis is a major update. Please **back up your world** before updating.\n\n---\n\n## ✨ Major Update v2.0.0\n### 🎨 Custom Theme Engine\n* **Full Custom Theme**: Stack multiple image layers on portraits and card backgrounds with per-layer Z-Index, position, scale, rotation, opacity, and blend mode controls.\n* **Action Menu Layers & Colors**: Fully customize every Action Menu element — buttons, headers, tabs, sidebars, list items, and more.\n* **Element Image Defaults**: Set custom images for bar frames, fills, backgrounds, dots, and number backgrounds globally.\n* **Per-Attribute Image Overrides**: Override element images per attribute with independent position, scale, and rotation.\n* **Card Size & Scale**: Configure card width/height globally and per-actor. Per-actor scale multiplier for individual sizing.\n* **Theme Export / Import**: Export your entire Custom Theme as a `.zip` (colors, layers, images, conditions, sounds). Import on any world — images are automatically uploaded and paths rewritten.\n\n### 🖥 Compact Mode\n* Cards collapse into themed portrait thumbnails and expand on hover.\n* Each theme (Iron, Glass, Fantasy, Medieval, Cyberpunk, Custom) has a unique compact shape.\n* Toggle via `Shift+C` or config checkbox. Per-actor override: Always Collapsed / Always Expanded / Use Global.\n\n### 🎲 Stat Click-to-Roll\n* Clicking a rollable stat now **triggers the dice roll directly**.\n  * **PF2e**: Saves, Skills, Perception, Initiative.\n  * **DnD5e**: Ability Checks, Saving Throws, Skills, Initiative.\n* Alt+Click opens the value editor on any stat. Rollable stats show a dotted underline on hover.\n\n### 🛠 Layout & Style Controls\n* **Category Visibility Filter**: Show/hide custom action menu categories by actor type or specific actor (`All` / `Only` / `Except`).\n* **Action Menu Custom Font**: Select a font for all Action Menu text with live preview.\n* **Global Portrait & Name Controls**: X, Y, Scale, and Color controls for portraits and names across all cards.\n* **Global Card Format**: Box/Popout selector with per-actor AUTO override.\n* **Per-Attribute Text Colors**: Custom label and value colors per attribute. Double-click to reset.\n* **Per-Badge Conditional Images**: Image overrides that switch by value threshold (≤, <, ≥, >, =, percentage or absolute).\n* **Independent Number Positioning**: Separate X/Y offsets for label and value text in Number-style attributes.\n* **End Turn Button Position**: X/Y offset controls for the end turn button.\n\n### 📡 Broadcast Account (OBS Overlay)\n* Designate a Foundry user as a dedicated broadcast account — overlay activates automatically on login, no special URL needed.\n* GM can set a default actor or show all tracked actors, and switch live without reloading OBS.\n\n### 🐛 Key Fixes\n* **Bar Fill Clipping**: Bar fill no longer overflows when rotated.\n* **End Turn Button**: No longer appears outside its intended context.\n* **Per-Actor Preview**: No longer resets to global defaults when switching actors in config.\n* **Config Performance**: Eliminated 3–6× redundant rebuilds on save; fixed event listener leak.",
    "downloadUrl": "",
    "forceResetId": null,
    "announcement": {
        "show": true,
        "id": "v2.0.0-update",
        "title": "🚀 v2.0.0: Custom Theme Engine, Compact Mode & More",
        "content": "Major update! Back up your world first. Adds Custom Theme layers, Compact Mode, Stat Click-to-Roll, Theme Export/Import, and much more."
    }
}
