{
    "latestVersion": "2.0.2",
    "critical": false,
    "notes": "## ✨ v2.0.2\n* **Global Macro Flavor Text**: GMs can right-click any global macro in the action menu to set custom flavor text. The text appears as a tooltip for all players.\n* **Personal Macro Deletion Fix**: Fixed a bug where deleting a personal macro from a category would revert after page refresh.\n* ⚠️ If a player has already set personal flavor text on a macro, it takes priority over the GM's global flavor. Clear the personal override to see the global text.\n\n---\n\n## 🐛 Hotfix v2.0.1\n* **OBS Overlay URL Fix**: Restored missing overlay.html bridge page — fixes \"Cannot GET\" errors when using overlay URLs.\n* **V12 Compatibility — Shift Key Detection**: Fixed isModifierActive crash on V12.\n* **V12 Compatibility — DialogV2 Callbacks**: Fixed dialog.element.querySelector crash in V12 for editResource, editSpellSlots, editMacro, and UpdateNotifier dialogs.\n* **Update Notification Scroll**: Long patch notes no longer overflow the dialog window.\n\n---\n\n## ⚠️ World Backup Recommended\nThis is a major update. Please **back up your world** before updating.\n\n---\n\n## ✨ Major Update v2.0.0\n### 🎨 Custom Theme Engine\n* **Full Custom Theme**: Stack multiple image layers on portraits and card backgrounds with per-layer Z-Index, position, scale, rotation, opacity, and blend mode controls.\n* **Action Menu Layers & Colors**: Fully customize every Action Menu element — buttons, headers, tabs, sidebars, list items, and more.\n* **Element Image Defaults**: Set custom images for bar frames, fills, backgrounds, dots, and number backgrounds globally.\n* **Per-Attribute Image Overrides**: Override element images per attribute with independent position, scale, and rotation.\n* **Card Size & Scale**: Configure card width/height globally and per-actor. Per-actor scale multiplier for individual sizing.\n* **Theme Export / Import**: Export your entire Custom Theme as a `.zip` (colors, layers, images, conditions, sounds). Import on any world — images are automatically uploaded and paths rewritten.\n\n### 🖥 Compact Mode\n* Cards collapse into themed portrait thumbnails and expand on hover.\n* Each theme (Iron, Glass, Fantasy, Medieval, Cyberpunk, Custom) has a unique compact shape.\n* Toggle via `Shift+C` or config checkbox. Per-actor override: Always Collapsed / Always Expanded / Use Global.\n\n### 🎲 Stat Click-to-Roll\n* Clicking a rollable stat on the HUD triggers the dice roll directly.\n* **PF2e**: Saves, Skills, Perception, Initiative. **DnD5e**: Ability Checks, Saving Throws, Skills, Initiative.\n* Alt+Click opens the value editor on any stat. Rollable stats show a dotted underline on hover.\n\n### 📺 Broadcast Account for OBS\n* Designate a Foundry user as a dedicated broadcast account — overlay mode activates automatically on login.\n* GM can switch the displayed actor live; changes apply to the broadcast client in real-time.\n\n### 🔧 And More\n* Category Visibility Filter (show/hide categories by actor type or identity)\n* Per-Attribute Text Colors, Global Name/Portrait/Card Format controls\n* Portrait Frame Layer, Per-Badge Conditional Images\n* Independent Number/Label Positioning, End Turn Button Position",
    "downloadUrl": "",
    "forceResetId": null,
    "announcement": {
        "show": true,
        "id": "v2.0.0-update",
        "title": "🚀 v2.0.0: Custom Theme Engine, Compact Mode & More",
        "content": "Major update! Back up your world first. Adds Custom Theme layers, Compact Mode, Stat Click-to-Roll, Theme Export/Import, and much more."
    }
}
